import type { Post } from '~/modules/posts/types';

export default function usePostsData() {
  const posts: Post[] = [
    {
      id: '1',
      title: '💵 Оплата в Южной Корее',
      excerpt:
        'В отличие от Японии, в которой наличка — основной способ оплаты, в Корее всё иначе, я бы сказал — впереди планеты всей. И всё благо...',
      publishedAt: '2024-12-20',
      thumbnail: '/images/post.jpeg',
      hasImage: true,
    },
    {
      id: '2',
      title: '🪪 K-ETA и таможня в Южной Корее',
      excerpt:
        'Ранее я рассказывал про получение визы в Японию. Хороший, но нервозный опыт вынуждает изучать подобные вопросы первым делом.\n\nПускают ли граждан РФ в Южную Корею? Да, даже если вы из Крыма — тоже да!\n\nСуществует несколько вариантов: виза и K-ETA анкета. Первый вариант делается дольше, требует больших усилий и не имеет особого смысла, если задача — туризм.',
      publishedAt: '2024-12-20',
      hasImage: false,
    },
    {
      id: '3',
      title: 'Аренда авто, дорожная и общественная инфраструктура',
      excerpt:
        '🚌 Общественный транспорт\nСравнивая с Японией, мы не испытали абсолютно никакого дискомфорта при его использовании. Нет проблем с навигацией, нет пропадающих указателей в метро, нет лотереи, в какой поезд ты сейчас сел — local или rapid...',
      publishedAt: '2024-12-20',
      thumbnail: '/images/post2.jpeg',
      hasImage: true,
    },
    {
      id: '4',
      title: 'Аренда авто, дорожная и общественная инфраструктура',
      excerpt:
        '🚌 Общественный транспорт\nСравнивая с Японией, мы не испытали абсолютно никакого дискомфорта при его использовании. Нет проблем с навигацией, нет пропадающих указателей в метро, нет лотереи, в какой поезд ты сейчас сел — local или rapid...',
      publishedAt: '2024-12-20',
      thumbnail: '/images/post2.jpeg',
      hasImage: true,
    },
  ];

  const getPostById = (id: string): Post | undefined => {
    return posts.find(post => post.id === id);
  };

  const getNextPost = (currentId: string): Post | null => {
    const currentIndex = posts.findIndex(post => post.id === currentId);
    if (currentIndex === -1 || currentIndex === posts.length - 1) return null;
    return posts[currentIndex + 1];
  };

  const getPreviousPost = (currentId: string): Post | null => {
    const currentIndex = posts.findIndex(post => post.id === currentId);
    if (currentIndex === -1 || currentIndex === 0) return null;
    return posts[currentIndex - 1];
  };

  return {
    posts,
    getPostById,
    getNextPost,
    getPreviousPost,
  };
}
